trade_exp/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d873fb7c-bffd-4ee5-9885-25af6032a41f">
  <name>СтатусыРасходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5394523f-1d18-4bb7-94ac-c5f9ed62888e">
    <name>КОтбору</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2fcc0b73-2f07-413e-aa8c-c99b38f0655b">
    <name>Подготовлен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9a7f17cc-0bed-409a-bf22-547957e4b4a3">
    <name>КПроверке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="92258e4f-ec60-44a5-9ef6-60af9d22d0f4">
    <name>ВПроцессеПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47a95af3-e94f-43dd-b105-b0009956fe02">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bdc2dd3b-b02c-4815-af56-2538b334fbf4">
    <name>Отгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыПриходныхОрдеров/СтатусыПриходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="58ab352b-2fda-4618-8f5e-14d83c1300f2">
  <name>СтатусыПриходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="51091c69-7e1a-4e28-8412-c3a970faaf1d">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fcb9b0b5-3360-47e9-bb41-297eaf6890d9">
    <name>ТребуетсяОбработка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c578192a-6448-4799-ac7a-946fede4b1fa">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ac78645-99c6-4dd6-9e7a-1a60a918a880">
    <name>Накладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71e89e4b-8b80-42ba-ad22-143b0015eb7c">
    <name>ЯчейкаПромежуточногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29d823c9-7e0c-4440-a6f7-0759575e73ac">
    <name>ПричинаОтказаОтСборки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="488f5004-17e0-4162-b7a3-08a11e08045c">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="628b3ce2-4791-489a-9690-8cc51d7f27c4">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="71ec9ff7-b367-4f30-a98e-368c90e6ac5f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="92946722-2614-4655-8fe5-999f3c499fd0">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/CommonModules/ОбменУТМПСервер/Module.bsl
Функция ЗапуститьФоновоеВыполнение(ТекстПроцедуры,СтруктураПараметров=Неопределено) Экспорт
    УникальныйИдентификатор = Новый УникальныйИдентификатор;
    ПараметрыВыполнения = Новый Массив;
    ПараметрыВыполнения.Добавить(ТекстПроцедуры);
    ПараметрыВыполнения.Добавить(СтруктураПараметров);
    
    ФоновыеЗадания.Выполнить("ОбменУТМПСервер.ФоноваяПроцедураОбменСМП",ПараметрыВыполнения,УникальныйИдентификатор);
    Возврат УникальныйИдентификатор;
КонецФункции

Процедура ФоноваяПроцедураОбменСМП(ТекстМодуля,ПараметрыВыполнения) Экспорт  

	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ТипОбмена = ПараметрыВыполнения.ТипОбмена;
		
		Если ТипОбмена = "ОбменДокументами" Тогда	
			Журнал = ПараметрыВыполнения.Журнал;
			Секция = ПараметрыВыполнения.Секция;
			Накладная = ПараметрыВыполнения.Накладная;
			ДатаВХ = ПараметрыВыполнения.ДатаВХ;
			НомерВХ = ПараметрыВыполнения.НомерВХ;
			
			Запрос = Новый Запрос;
			Запрос.Текст =  
			"ВЫБРАТЬ
			|	СостоянияДокументовОбменМП.Склад КАК Склад,
			|	СостоянияДокументовОбменМП.РабочийУчасток КАК РабочийУчасток,
			|	СостоянияДокументовОбменМП.ДокументНакладная КАК ДокументНакладная,
			|	СостоянияДокументовОбменМП.ДокументОрдер КАК ДокументОрдер,
			|	СостоянияДокументовОбменМП.Состояние КАК Состояние,
			|	СостоянияДокументовОбменМП.Обработано КАК Обработано,
			|	СостоянияДокументовОбменМП.ЯПХ КАК ЯПХ,
			|	СостоянияДокументовОбменМП.Сотрудник КАК Сотрудник,
			|	СостоянияДокументовОбменМП.ИДклиента КАК ИДклиента
			|ИЗ
			|	РегистрСведений.СостоянияДокументовОбменМП КАК СостоянияДокументовОбменМП
			|ГДЕ
			|	СостоянияДокументовОбменМП.ДокументНакладная = &ДокументНакладная
			|	И СостоянияДокументовОбменМП.РабочийУчасток = &РабочийУчасток
			|   И НЕ СостоянияДокументовОбменМП.Обработано";
			
			Запрос.УстановитьПараметр("ДокументНакладная", Накладная);
			Запрос.УстановитьПараметр("РабочийУчасток", Секция);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ПопыткаЗаписи = 0;
			
			Для ПопыткаЗаписи = 0 По 4 Цикл
				ВыборкаДетальныеЗаписи.Следующий();
				
				ПопыткаЗаписи = ПопыткаЗаписи + 1;
				Ордер = ВыборкаДетальныеЗаписи.ДокументОрдер;
				
				ИмяТЧ = ?(Журнал = "Отгрузка","ОтгружаемыеТовары","Товары");
				
				Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.СостоянияДокументовТСД.ВРаботе Тогда
					
					Статус = ?(Журнал = "Отгрузка",Перечисления.СтатусыРасходныхОрдеров.КОтбору,Перечисления.СтатусыПриходныхОрдеров.ВРаботе);
					
					Попытка
						НачатьТранзакцию();
						
						ОрдерОбъект = Ордер.ПолучитьОбъект();
						ОрдерОбъект.Заблокировать();
						ОрдерОбъект.ПометкаУдаления = Ложь;
						ОрдерОбъект.Статус = Статус;  
						
						ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
						Для Каждого Строка Из ОрдерОбъект[ИмяТЧ] Цикл
							
							Строка.КоличествоУпаковок = 0;
							Строка.Количество = 0;
							
						КонецЦикла;
						
						Если Журнал = "Отгрузка" Тогда
							ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОрдерОбъект, Истина);
						Иначе 
							ОрдерОбъект.Комментарий = ПараметрыВыполнения.Комментарий;
							ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОрдерОбъект,,,РежимЗаписиДокумента.Проведение);
						КонецЕсли;
						
						Если ПараметрыВыполнения.Отмена Тогда
							
							УдалитьСвязанныеЗаписиОбменМП(Ордер);
							
						Иначе
							
							ЗафиксироватьСтатусВыполненияОперацииВРегистре(ВыборкаДетальныеЗаписи);
							
						КонецЕсли;
						
						ЗафиксироватьТранзакцию();
						
						Прервать;
						
					Исключение  
						
						ОтменитьТранзакцию();  
						ЗаписьЖурналаРегистрации("ФоновоеОбменМП.СозданиеОрдера", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
						
					КонецПопытки;
				Иначе
					
					Если Журнал = "Отгрузка" Тогда
						
						Статус = ?((ВыборкаДетальныеЗаписи.Состояние
						= Перечисления.СостоянияДокументовТСД.Преднаборка),
						Перечисления.СтатусыРасходныхОрдеров.КОтгрузке,
						Перечисления.СтатусыРасходныхОрдеров.Отгружен);
						
					Иначе
						
						Статус = ?((ВыборкаДетальныеЗаписи.Состояние
						= Перечисления.СостоянияДокументовТСД.Преднаборка),
						Перечисления.СтатусыПриходныхОрдеров.ТребуетсяОбработка,
						Перечисления.СтатусыПриходныхОрдеров.Принят);
						
					КонецЕсли;
					
					Попытка
						НачатьТранзакцию();
						ОрдерОбъект = Ордер.ПолучитьОбъект();
						ОрдерОбъект.Заблокировать();
						
						ОрдерОбъект.Статус = Статус;
						
						
						Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЯчейкаПромежуточногоХранения",
							ОрдерОбъект.Метаданные()) И ОрдерОбъект.Статус
							= Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Тогда
							ОрдерОбъект.ЯчейкаПромежуточногоХранения = ВыборкаДетальныеЗаписи.ЯПХ;
						КонецЕсли;
						
						ИзменитьДанныеСтроки(ОрдерОбъект, ИмяТЧ);
						
						Если Журнал = "Отгрузка" Тогда
							
							МассивСтрок = ОрдерОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("КоличествоУпаковок",
							0));
							
							
							Для Каждого Строка Из МассивСтрок Цикл
								ОрдерОбъект.ОтгружаемыеТовары.Удалить(Строка);
							КонецЦикла;
							
							Документы.РасходныйОрдерНаТовары.ИзменитьТоварыПоРаспоряжениямПоОтгружаемымТоварам(
							ОрдерОбъект);
							Если ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен
								Или ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Тогда
								Документы.РасходныйОрдерНаТовары.ЗаполнитьДействиеВСтроках(ОрдерОбъект);
								Если ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
									ОрдерОбъект.Дата = ТекущаяДата();
									ОрдерОбъект.ДатаОтгрузки = ТекущаяДата();
								КонецЕсли;
							КонецЕсли; 
							
						КонецЕсли;
						
						Если Журнал = "Приемка" Тогда
							Если ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда	
								МассивСтрок = ОрдерОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("КоличествоУпаковок",
								0));
								
								Для Каждого Строка Из МассивСтрок Цикл
									ОрдерОбъект.Товары.Удалить(Строка);
								КонецЦикла;
							КонецЕсли;
							ОрдерОбъект.Комментарий = ПараметрыВыполнения.Комментарий;
						КонецЕсли;
						
						Если Журнал = "Пересчет" Тогда
							ОрдерОбъект.ВремяОкончания = ТекущаяДата();
							ОрдерОбъект.Просчитано = Истина;
							ОрдерОбъект.ПодтвержденСкладом = Истина;
						КонецЕсли;
						
						ОрдерОбъект.ПометкаУдаления = Ложь;
						ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
						ЗафиксироватьСтатусВыполненияОперацииВРегистре(ВыборкаДетальныеЗаписи);
						
						ЗафиксироватьТранзакцию(); 
						
						Прервать;   
						
					Исключение
						
						ОтменитьТранзакцию();  
						ЗаписьЖурналаРегистрации("ФоновоеОбменМП.ИзменениеОрдера", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
						
					КонецПопытки; 
					
				КонецЕсли;
			КонецЦикла; 
			
		Иначе
			
			ОрдерОбъект = ПараметрыВыполнения.Документ.ПолучитьОбъект();
			
			Если ИзменитьДанныеСтроки(ОрдерОбъект, ПараметрыВыполнения.ИмяТЧ) Тогда
				
				//ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОрдерОбъект, Истина);
				Если ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОрдерОбъект,,,РежимЗаписиДокумента.Проведение);
				Иначе
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОрдерОбъект, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ФоновоеОбменМП", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки()); 
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры          

Функция СоздатьРасходныйОрдерПоНакладной(СтруктураДокумента) Экспорт
	
	РасходныйОрдер = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(РасходныйОрдер,СтруктураДокумента,"Склад,РабочийУчасток,Сотрудник");
	РасходныйОрдер.Накладная = СтруктураДокумента.Документ; 
	ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	РасходныйОрдер.Дата = ТекущаяДата(); 
	РасходныйОрдер.ДатаОтгрузки = ТекущаяДата();
	РасходныйОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору;
	РасходныйОрдер.Ответственный = ТекущийПользователь;
	РасходныйОрдер.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(РасходныйОрдер.Приоритет);
	РасходныйОрдер.Получатель = Документы.РасходныйОрдерНаТовары.ПолучательДляЗаполнения(РасходныйОрдер.Накладная); 
	РасходныйОрдер.Контролер = ТекущийПользователь;
	РасходныйОрдер.ОтгрузкаПоЗаданиюНаПеревозку = Ложь;
	РасходныйОрдер.СкладскаяОперация = ПолучитьСкладскуюОперацию(РасходныйОрдер.Накладная);
	
	ТЧТовары = Документы.РасходныйОрдерНаТовары.ПолучитьТоварыДляЗаполнения(РасходныйОрдер.Накладная,РасходныйОрдер.РабочийУчасток,РасходныйОрдер.Склад);
	РасходныйОрдер.ТоварыПоРаспоряжениям.Загрузить(ТЧТовары);				
	РасходныйОрдер.ОтгружаемыеТовары.Загрузить(ТЧТовары); 
	РасходныйОрдер.ОтгружаемыеТовары.Свернуть("Действие,Номенклатура,Характеристика,Назначение,Серия,Упаковка","Количество,КоличествоУпаковок");
		
	//Попытка
		РасходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);    
	//Исключение 
	//	ОписаниеОшибки();
	//КонецПопытки   
	
	Возврат РасходныйОрдер.Ссылка;	
	
КонецФункции

Функция СоздатьПриходныйОрдерПоНакладной(СтруктураДокумента) Экспорт
	
	ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ПриходныйОрдер,СтруктураДокумента,"Склад,РабочийУчасток,Сотрудник,НомерВходящегоДокумента,ДатаВходящегоДокумента");
	ПриходныйОрдер.Распоряжение = СтруктураДокумента.Документ; 
	ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	ПриходныйОрдер.Дата = ТекущаяДата();
	ПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.ВРаботе;
	ПриходныйОрдер.Ответственный = ТекущийПользователь;
	ПриходныйОрдер.Отправитель = ОтправительДляЗаполнения(ПриходныйОрдер.Распоряжение); 
	ПриходныйОрдер.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению;
	ПриходныйОрдер.ХозяйственнаяОперация = СтруктураДокумента.ХозяйственнаяОперация;
	ПриходныйОрдер.ЗаполнитьТоварыПоТоварамКПоступлению("НоменклатураКоличество",ТекущаяДата());
	
	//Попытка
		ПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);    
	//Исключение 
	//	ОписаниеОшибки();
	//КонецПопытки   
	
	Возврат ПриходныйОрдер.Ссылка;	
	
КонецФункции

Функция ИзменитьДанныеСтроки(ОрдерОбъект, ИмяТЧ)

    ДанныеИзменены = Ложь;
    
	КоличествоЗаполнено = ЗаполнитьКоличествоВОрдере(ОрдерОбъект, ИмяТЧ);
	МаркировкаЗаполнена = ЗаполнитьМаркировкуВОрдере(ОрдерОбъект);

    ДанныеИзменены = КоличествоЗаполнено ИЛИ МаркировкаЗаполнена;
    
    Возврат ДанныеИзменены;
    
КонецФункции

Функция ЗаполнитьКоличествоВОрдере(ОрдерОбъект, ИмяТЧ)
	
	КоличествоЗаполнено = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СостоянияТоваровОбменМП.ДокументОрдер,
	|	СостоянияТоваровОбменМП.Номенклатура,
	|	СостоянияТоваровОбменМП.Назначение,
	|	СостоянияТоваровОбменМП.Характеристика,
	|	СостоянияТоваровОбменМП.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.СостоянияТоваровОбменМП КАК СостоянияТоваровОбменМП
	|ГДЕ
	|	НЕ СостоянияТоваровОбменМП.Обработано
	|	И СостоянияТоваровОбменМП.ДокументОрдер = &ДокументОрдер";
	
	Запрос.УстановитьПараметр("ДокументОрдер", ОрдерОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Количество = 0;
		Количество = ВыборкаДетальныеЗаписи.Количество;

		МассивСтрок = ОрдерОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Назначение",ВыборкаДетальныеЗаписи.Номенклатура,ВыборкаДетальныеЗаписи.Характеристика,ВыборкаДетальныеЗаписи.Назначение));
		
		Если МассивСтрок.Количество() > 0 Тогда
			Для Каждого Строка Из МассивСтрок Цикл
				Строка.КоличествоУпаковок = Количество;
				Строка.Количество = Количество;
			КонецЦикла;
		Иначе 
			НоваяСтрока = ОрдерОбъект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			//НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
			НоваяСтрока.КоличествоУпаковок = Количество;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.СостоянияТоваровОбменМП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Обработано = Истина;

		МенеджерЗаписи.Записать();
		
		КоличествоЗаполнено = Истина;
		
     КонецЦикла;

     Возврат КоличествоЗаполнено;
     
КонецФункции

Функция ЗаполнитьМаркировкуВОрдере(ОрдерОбъект) Экспорт
		
	МаркировкаЗаполнена = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостояниеМаркировкиОбменМП.ДокументОрдер КАК ДокументОрдер,
	|	СостояниеМаркировкиОбменМП.ШтрихкодМаркировки КАК ШтрихкодМаркировки,
	|	СостояниеМаркировкиОбменМП.Действие КАК Действие
	|ИЗ
	|	РегистрСведений.СостояниеМаркировкиОбменМП КАК СостояниеМаркировкиОбменМП
	|ГДЕ
	|	НЕ СостояниеМаркировкиОбменМП.Обработано
	|	И СостояниеМаркировкиОбменМП.ДокументОрдер = &ДокументОрдер";

	Запрос.УстановитьПараметр("ДокументОрдер", ОрдерОбъект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		МассивСтрок = ОрдерОбъект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ВыборкаДетальныеЗаписи.ШтрихкодМаркировки));
		
		Если ВыборкаДетальныеЗаписи.Действие = Перечисления.ТипыЗаданий.Удаление Тогда
            Для Каждого Строка Из МассивСтрок Цикл
				ОрдерОбъект.ШтрихкодыУпаковок.Удалить(Строка);
			КонецЦикла;
		Иначе
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока = ОрдерОбъект.ШтрихкодыУпаковок.Добавить();
				НоваяСтрока.ШтрихкодУпаковки = ВыборкаДетальныеЗаписи.ШтрихкодМаркировки;
			КонецЕсли;
		КонецЕсли;

		//МассивСтрок = ОрдерОбъект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки",
		//	ВыборкаДетальныеЗаписи.ШтрихкодМаркировки));

		//Если МассивСтрок.Количество() = 0 Тогда
		//	НоваяСтрока = ОрдерОбъект.ШтрихкодыУпаковок.Добавить();
		//	НоваяСтрока.ШтрихкодУпаковки = ВыборкаДетальныеЗаписи.ШтрихкодМаркировки;
		//КонецЕсли;

		МенеджерЗаписи = РегистрыСведений.СостояниеМаркировкиОбменМП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Обработано = Истина;

		МенеджерЗаписи.Записать();

		МаркировкаЗаполнена = Истина;
	КонецЦикла;

	Возврат МаркировкаЗаполнена;

КонецФункции

Функция ПолучитьРасходныйОрдер(Склад,Секция,Накладная) 
	
	Ордер = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Проведен
		|	И РасходныйОрдерНаТовары.РабочийУчасток = &РабочийУчасток
		|	И РасходныйОрдерНаТовары.Накладная = &Накладная
		|	И РасходныйОрдерНаТовары.Склад = &Склад
		|	И НЕ РасходныйОрдерНаТовары.Статус = &СтатусРО";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СтатусРО", Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ордер = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
    Возврат Ордер; 
	
КонецФункции

Функция ПолучитьПриходныйОрдер(Склад,Секция,Накладная) 
	
	Ордер = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ  
		|	ПриходныйОрдерНаТовары.Проведен
		|	И ПриходныйОрдерНаТовары.РабочийУчасток = &РабочийУчасток
		|	И ПриходныйОрдерНаТовары.Распоряжение = &Накладная
		|	И ПриходныйОрдерНаТовары.Статус = &СтатусПО
		|	И ПриходныйОрдерНаТовары.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("РабочийУчасток", Секция);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СтатусПО", Перечисления.СтатусыПриходныхОрдеров.Принят);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ордер = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
    Возврат Ордер; 
	
КонецФункции

Функция ПолучитьСкладскуюОперацию(Накладная) Экспорт 
	
	СкладскаяОперация = Перечисления.СкладскиеОперации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СкладыСервер.ТекстЗапросаСкладскаяОперацияТипДокумента()+ " 
	|ВЫБРАТЬ
	|	СкладскаяОперацияТипДокумента.СкладскаяОперация КАК СкладскаяОперация
	|ИЗ
	|	СкладскаяОперацияТипДокумента КАК СкладскаяОперацияТипДокумента
	|ГДЕ
	|	СкладскаяОперацияТипДокумента.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип",ТипЗнч(Накладная));
	
	Результат = Запрос.Выполнить().Выбрать();  
	Результат.Следующий();
	
	СкладскаяОперация = Результат.СкладскаяОперация;
	
	Возврат  СкладскаяОперация;
	
КонецФункции 

Функция ОтправительДляЗаполнения(Накладная)    

	Возврат ?(ТипЗнч(Накладная) = Тип("ДокументСсылка.ПеремещениеТоваров"), Накладная.СкладОтправитель, Накладная.Партнер);
	
КонецФункции

Процедура УдалитьСвязанныеЗаписиОбменМП(Документ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СостоянияДокументовОбменМП = РегистрыСведений.СостоянияДокументовОбменМП;
	НаборЗапись = СостоянияДокументовОбменМП.СоздатьНаборЗаписей();
			 
	НаборЗапись.Отбор.ДокументОрдер.Установить(Документ);
	НаборЗапись.Записать();
	
	СостоянияТоваровОбменМП = РегистрыСведений.СостоянияТоваровОбменМП;
	НаборЗапись = СостоянияТоваровОбменМП.СоздатьНаборЗаписей();
			 
	НаборЗапись.Отбор.ДокументОрдер.Установить(Документ);
	НаборЗапись.Записать();

	УстановитьПривилегированныйРежим(Ложь);  

КонецПроцедуры

Процедура ЗафиксироватьСтатусВыполненияОперацииВРегистре(ВыборкаДетальныеЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.СостоянияДокументовОбменМП.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
	МенеджерЗаписи.Обработано = Истина;
	
	МенеджерЗаписи.Записать();  
	
КонецПроцедуры

Функция ОрдерЗаполнялсяВМП(Ордер, Накладная) Экспорт
	УстановитьПривилегированныйРежим(Истина);	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияДокументовОбменМП.ДокументНакладная КАК ДокументНакладная,
	|	СостоянияДокументовОбменМП.ДокументОрдер КАК ДокументОрдер
	|ИЗ
	|	РегистрСведений.СостоянияДокументовОбменМП КАК СостоянияДокументовОбменМП
	|ГДЕ
	|	СостоянияДокументовОбменМП.ДокументНакладная = &ДокументНакладная
	|	И СостоянияДокументовОбменМП.ДокументОрдер = &ДокументОрдер";
	
	Запрос.УстановитьПараметр("ДокументНакладная", Накладная);
	Запрос.УстановитьПараметр("ДокументОрдер", Ордер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции 

Функция ПолучитьТоварыИзРегистра(Ордер, Обработанные = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СостоянияТоваровОбменМП.ДокументОрдер,
	|	СостоянияТоваровОбменМП.Номенклатура,
	|	СостоянияТоваровОбменМП.Назначение,
	|	СостоянияТоваровОбменМП.Характеристика,
	|	СостоянияТоваровОбменМП.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.СостоянияТоваровОбменМП КАК СостоянияТоваровОбменМП
	|ГДЕ
	|	СостоянияТоваровОбменМП.ДокументОрдер = &ДокументОрдер
	|	И СостоянияТоваровОбменМП.Обработано = &Обработано";
	
	Запрос.УстановитьПараметр("ДокументОрдер", Ордер);
	Запрос.УстановитьПараметр("Обработано", Обработанные);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	Возврат ТЗ;
		
КонецФункции 

Функция ЗаполнитьОрдер(ОрдерОбъект, ИмяТЧ, Отработаные) Экспорт
    УстановитьПривилегированныйРежим(Истина);
	КоличествоЗаполнено = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СостоянияТоваровОбменМП.ДокументОрдер,
	|	СостоянияТоваровОбменМП.Номенклатура,
	|	СостоянияТоваровОбменМП.Назначение,
	|	СостоянияТоваровОбменМП.Характеристика,
	|	СостоянияТоваровОбменМП.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.СостоянияТоваровОбменМП КАК СостоянияТоваровОбменМП
	|ГДЕ
	|	СостоянияТоваровОбменМП.ДокументОрдер = &ДокументОрдер
	|	И СостоянияТоваровОбменМП.Обработано = &Обработано";
	
	Запрос.УстановитьПараметр("ДокументОрдер", ОрдерОбъект.Ссылка);
	Запрос.УстановитьПараметр("Обработано", Отработаные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Количество = 0;
		Количество = ВыборкаДетальныеЗаписи.Количество;

		МассивСтрок = ОрдерОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Назначение",ВыборкаДетальныеЗаписи.Номенклатура,ВыборкаДетальныеЗаписи.Характеристика,ВыборкаДетальныеЗаписи.Назначение));
		
		Если МассивСтрок.Количество() > 0 Тогда
			Для Каждого Строка Из МассивСтрок Цикл
				Строка.КоличествоУпаковок = Количество;
				Строка.Количество = Количество;
			КонецЦикла;
		Иначе 
			НоваяСтрока = ОрдерОбъект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			Если ИмяТЧ = "ОтгружаемыеТовары" Тогда
				НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
			КонецЕсли;
			НоваяСтрока.КоличествоУпаковок = Количество;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.СостоянияТоваровОбменМП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Обработано = Истина;

		МенеджерЗаписи.Записать();
		
		КоличествоЗаполнено = Истина;
		
     КонецЦикла;

     Возврат КоличествоЗаполнено;
     УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции
